---
kind: type
id: T:Autodesk.Revit.DB.GenericForm
source: html/d64cecab-ceec-407e-6f09-0b83f192aa1a.htm
---
# Autodesk.Revit.DB.GenericForm

Provides access to the Generic Form model in Autodesk Revit.

## Syntax (C#)
```csharp
public class GenericForm : CombinableElement
```

## Remarks
The Generic Form object can be queried for a generic form for use in family modeling and
massing. It is the base class of Sweep, Blend, Extrusion, Revolution.